app/Models/M_buku.php

SELECT *
FROM `tbl_kategori`
---
    function getKategoriList(){
        return $this->db->table('tbl_kategori')->get()->getResult();