app/Models/M_homeuser.php

    function listByCategory()
    {
        $builder = $this->db->table('tbl_buku');
        $builder->select('tbl_buku.*, tbl_kategori.nama_kategori');
        $builder->join('tbl_kategori', 'tbl_kategori.kode_kategori = tbl_buku.kode_kategori', 'left');
        $builder->orderBy('tbl_kategori.nama_kategori', 'asc');
        $query = $builder->get();
---
SELECT `tbl_buku`.*, `tbl_kategori`.`nama_kategori`
FROM `tbl_buku`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`kode_kategori` = `tbl_buku`.`kode_kategori`
ORDER BY `tbl_kategori`.`nama_kategori` ASC