app/Models/M_Kategori.php

    function list_all(){
        $query = $this->db->get();
---
SELECT *
FROM `tbl_kategori`